---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FixedFabricationPartNotChangeLength
source: html/c4b65ea8-7731-46fb-d84f-059d002bc889.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FixedFabricationPartNotChangeLength Property

Failed to change length of fixed part.

## Syntax (C#)
```csharp
public static FailureDefinitionId FixedFabricationPartNotChangeLength { get; }
```